Revit 2026 API

# MEPSystemDivideSystem Method

---

Divide the phyisical networks in the system and create a new system for each network.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> DivideSystem(
	Document ADoc
)
```
```vb
Public Function DivideSystem (
	ADoc As Document
) As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ DivideSystem(
	Document^ ADoc
)
```
```fsharp
member DivideSystem :
        ADoc : Document -> ICollection<ElementId>
```

#### Parameters

ADoc Document
     The document.

#### Return Value

ICollectionElementId The id of new created systems.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The system is not dividable. |

This function only works for Hvac and Piping system.

#### Reference

MEPSystem Class

Autodesk.Revit.DB Namespace